app/Controllers/Admin/UsuariosController.php

SELECT `u`.*, `a`.`name` as `area`
FROM `users` as `u`
JOIN `areas` as `a` ON `u`.`area` = `a`.`id`
---
    public function index()
    {
        $db = \Config\Database::connect();
        $this->session = \Config\Services::session();

        $builder = $this->db->table('users as u');
        $builder->select('u.*, a.name as area');
        $builder->join('areas as a', 'u.area = a.id');
        $usuarios = $builder->get()->getResult();